In [1]:
import pandas as pd

In [2]:
df_customer = pd.read_csv('1.Data_Customer.csv')
df_transaction = pd.read_csv('2.Data_MyVIB_Transaction.csv')
df_activities = pd.read_csv('3.Data_MyVIB_Activity.csv')
df_deposit = pd.read_csv('4.Data_Deposit.csv')
df_lending = pd.read_csv('5.Data_Lending.csv')
df_card = pd.read_csv('6.Data_Card.csv')

c:\users\x\appdata\local\programs\python\python39\lib\site-packages\IPython\core\interactiveshell.py:3155: DtypeWarning: Columns (5,6,7,8) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
print(df_customer.head())

   CUSTOMER_NUMBER CLIENT_SEX CLIENT_CREATE_DATE        DATE_OF_BIRTH  \
0           639362          M         2019-04-23  1996-01-01 00:00:00
1           452440          M         2019-01-11  1999-10-10 00:00:00
2           326290          F         2019-05-27  1996-06-29 00:00:00
3            20802          M         2019-11-12  1992-08-07 00:00:00
4           114244          M         2019-03-29  1973-10-15 00:00:00

  STAFF_VIB IB_REGISTER_DATE EB_REGISTER_CHANNEL SMS VERIFY_METHOD
0         N       2019-04-23              BRANCH   Y           SMS
1         N       2019-01-11              BRANCH   Y     SMART_OTP
2         N       2019-05-27              BRANCH   Y           SMS
3         N       2019-11-12              BRANCH   Y     SMART_OTP
4         N       2019-03-29              BRANCH   N           SMS

In [4]:
# trích xuất tháng
df_activities['MONTH']=pd.DatetimeIndex(df_activities['ACTIVITY_DATE']).month

In [5]:
print(df_activities.head())

  ACTIVITY_DATE DAY_OF_WEEK  ACTIVITY_HOUR  ACTIVITY_NO  CUSTOMER_NUMBER  \
0     1/22/2019         Tue             20            2           630178
1     1/10/2019         Thu             18           16           630178
2     1/26/2019         Sat             17           15           630178
3      1/2/2019         Wed              9           27           630178
4     1/19/2019         Sat              8            3           630178

           ACTIVITY_NAME  MONTH
0  MB_INTEREST_RATE_VIEW      1
1  MB_INTEREST_RATE_VIEW      1
2  MB_INTEREST_RATE_VIEW      1
3  MB_INTEREST_RATE_VIEW      1
4  MB_INTEREST_RATE_VIEW      1

In [6]:
df_activities['MONTH'].unique()

array([ 1,  2,  3,  4,  5,  7,  8,  9, 10, 12, 11,  6], dtype=int64)

In [9]:
df_activities = df_activities.drop(columns = 'ACTIVITY_DATE')

In [10]:
df_activities.head()

,DAY_OF_WEEK,ACTIVITY_HOUR,ACTIVITY_NO,CUSTOMER_NUMBER,ACTIVITY_NAME,MONTH
0,Tue,20,2,630178,MB_INTEREST_RATE_VIEW,1
1,Thu,18,16,630178,MB_INTEREST_RATE_VIEW,1
2,Sat,17,15,630178,MB_INTEREST_RATE_VIEW,1
3,Wed,9,27,630178,MB_INTEREST_RATE_VIEW,1
4,Sat,8,3,630178,MB_INTEREST_RATE_VIEW,1

In [12]:
df_group_activity = df_activities.groupby(['MONTH','CUSTOMER_NUMBER'])['ACTIVITY_HOUR'].sum()
print(df_group_activity)

MONTH  CUSTOMER_NUMBER
1      456                 216
       1063                 55
       2293                140
       3666                109
       4245                 48
                          ...
12     999966               85
       999969             1278
       999972              630
       999982              764
       999996              187
Name: ACTIVITY_HOUR, Length: 321669, dtype: int64

In [13]:
df_transaction.head()

,TRANS_LV1,TRANS_LV2,TRANS_DATE,DAY_OF_WEEK,TRANS_HOUR,TRANS_NO,TRANS_AMOUNT,CUSTOMER_NUMBER
0,Transfer,Outside_VIB,2019-01-03,Thu,17,2,189771864.0,701619
1,Transfer,Outside_VIB,2019-07-01,Mon,13,2,30224900.0,701619
2,Transfer,Outside_VIB,2019-01-02,Wed,15,1,100000.0,701619
3,Payment,Credit_card_repayment,2019-01-03,Thu,14,1,85000000.0,262123
4,Payment,Credit_card_repayment,2019-01-28,Mon,22,1,83000000.0,262123

In [14]:
# trích xuất tháng
df_transaction['MONTH']=pd.DatetimeIndex(df_transaction['TRANS_DATE']).month

In [21]:
df_transaction.drop(columns='TRANS_DATE')

,TRANS_LV1,TRANS_LV2,DAY_OF_WEEK,TRANS_HOUR,TRANS_NO,TRANS_AMOUNT,CUSTOMER_NUMBER,MONTH
0,Transfer,Outside_VIB,Thu,17,2,189771864.0,701619,1
1,Transfer,Outside_VIB,Mon,13,2,30224900.0,701619,7
2,Transfer,Outside_VIB,Wed,15,1,100000.0,701619,1
3,Payment,Credit_card_repayment,Thu,14,1,85000000.0,262123,1
4,Payment,Credit_card_repayment,Mon,22,1,83000000.0,262123,1

In [23]:
df_group_transaction = df_transaction.groupby(['MONTH','CUSTOMER_NUMBER'])['TRANS_AMOUNT','TRANS_HOUR'].sum()
print(df_group_transaction)

<ipython-input-23-9fb1d5e3aca2>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df_group_transaction = df_transaction.groupby(['MONTH','CUSTOMER_NUMBER'])['TRANS_AMOUNT','TRANS_HOUR'].sum()

                       TRANS_AMOUNT  TRANS_HOUR
MONTH CUSTOMER_NUMBER
1     6341             5.800000e+05          26
      6489             6.000000e+05          12
      7266             1.000000e+05           9
      7913             4.003493e+06          32
      8566             1.022800e+09         157
...                             ...         ...
12    999948           6.490000e+05          21
      999959           5.810000e+06          63
      999969           6.837000e+06         234
      999972           2.500000e+06          32
      999982           4.655000e+06           7

[195473 rows x 2 columns]

In [24]:
print(df_deposit)

              MONTH  COUNT_CA_ACCT  AVG_CA_BALANCE  COUNT_TD_ACCT  \
0         1/31/2019              1       246774.19              0
1         2/28/2019              1       209207.36              0
2         3/31/2019              1       213225.90              0
3         4/30/2019              1       211761.87              0
4         5/31/2019              1       222391.16              0
...             ...            ...             ...            ...
1258419  12/31/2019              1        32258.06              0
1258420  12/31/2019              1        32258.16              0
1258421  12/31/2019              1        31903.23              0
1258422  12/31/2019              1         1612.90              2
1258423  12/31/2019              1        16129.03              0

         AVG_TD_BALANCE  CUSTOMER_NUMBER
0                  0.00           914393
1                  0.00           914393
2                  0.00           914393
3                  0.00           914393
4                  0.00           914393
...                 ...              ...
1258419            0.00           539614
1258420            0.00           877874
1258421            0.00            80041
1258422     41290322.58           409371
1258423            0.00           338810

[1258424 rows x 6 columns]

In [25]:
df_deposit['MONTH']=pd.DatetimeIndex(df_deposit['MONTH']).month

In [33]:
df_deposit.head()

,MONTH,COUNT_CA_ACCT,AVG_CA_BALANCE,COUNT_TD_ACCT,AVG_TD_BALANCE,CUSTOMER_NUMBER
0,1,1,246774.19,0,0.0,914393
1,2,1,209207.36,0,0.0,914393
2,3,1,213225.90,0,0.0,914393
3,4,1,211761.87,0,0.0,914393
4,5,1,222391.16,0,0.0,914393

In [28]:
df_lending['MONTH']=pd.DatetimeIndex(df_lending['MONTH']).month

In [34]:
df_lending.head()

   MONTH  COUNT_OF_LOAN  AVG_LOAN_AMOUNT  CUSTOMER_NUMBER
0      1              1       15000000.0           811795
1      2              1       13450000.0           811795
2      4              1       14169673.0           811795
3      3              1       12901665.0           811795
4      9              1       13274815.0           811795

In [31]:
df_card['MONTH']=pd.DatetimeIndex(df_card['MONTH']).month

In [35]:
df_card.head()

   MONTH  COUNT_CREDITCARD  COUNT_DEBITCARD  CUSTOMER_NUMBER
0      9                 0                1           914326
1      4                 0                1           914326
2     11                 0                1           914326
3      8                 0                1           914326
4     12                 0                1           914326

In [36]:
# concatenate data
dfs = [df_customer,df_group_activity,df_group_transaction,df_deposit,df_lending,df_card]

df_merge = pd.concat(dfs)

In [38]:
print(df_merge.info())

<class 'pandas.core.frame.DataFrame'>
Index: 3513809 entries, 0 to 871588
Data columns (total 21 columns):
 #   Column               Dtype
---  ------               -----
 0   0                    float64
 1   AVG_CA_BALANCE       float64
 2   AVG_LOAN_AMOUNT      float64
 3   AVG_TD_BALANCE       float64
 4   CLIENT_CREATE_DATE   object
 5   CLIENT_SEX           object
 6   COUNT_CA_ACCT        float64
 7   COUNT_CREDITCARD     float64
 8   COUNT_DEBITCARD      float64
 9   COUNT_OF_LOAN        float64
 10  COUNT_TD_ACCT        float64
 11  CUSTOMER_NUMBER      float64
 12  DATE_OF_BIRTH        object
 13  EB_REGISTER_CHANNEL  object
 14  IB_REGISTER_DATE     object
 15  MONTH                float64
 16  SMS                  object
 17  STAFF_VIB            object
 18  TRANS_AMOUNT         float64
 19  TRANS_HOUR           float64
 20  VERIFY_METHOD        object
dtypes: float64(13), object(8)
memory usage: 589.8+ MB
None

In [39]:
df_merge.to_csv(r'E:\VTCAI\Final_Project\Track 1 Datarathon\df_merge.csv')

In [41]:
df_merge.isnull().sum()

0                      3192140
AVG_CA_BALANCE         2255385
AVG_LOAN_AMOUNT        2937378
AVG_TD_BALANCE         2255385
CLIENT_CREATE_DATE     3223586
CLIENT_SEX             3227869
COUNT_CA_ACCT          2255385
COUNT_CREDITCARD       2642220
COUNT_DEBITCARD        2642220
COUNT_OF_LOAN          2937378
COUNT_TD_ACCT          2255385
CUSTOMER_NUMBER         517142
DATE_OF_BIRTH          3227875
EB_REGISTER_CHANNEL    3354834
IB_REGISTER_DATE       3354834
MONTH                   807365
SMS                    3354834
STAFF_VIB              3223586
TRANS_AMOUNT           3318336
TRANS_HOUR             3318336
VERIFY_METHOD          3354862
dtype: int64

100.0